yanlunyao/stm32_lwip_ucos_udp_test/UCOS-Sem/src/dev/rn8209x.c
#include "includes.h"
#include <spi.h>
#include <ssi.h>
#include "rn8209x.h"
#include <Hw_memmap.h>
#include "comm.h"
#include "dev.h"
#include "DLT645.h"
#include "devI2C.h"
#include "devTimer.h"

BYTE EEPROMPARAM[EEPROM_COUNT]={0};
#if 0
rn8209_fmt_t initTable[18] =
{
    {SYSCON,    WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNSYSCON]},  //0x40  开启B通道电流
    {IARMSOS,   WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNIARMSOS]},//0xFB96
    {IBRMSOS,   WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNIBRMSOS]}, 
    {IBGAIN,    WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNIBGAIN]},
    {GPQA,      WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNGPQA]}, 
    {GPQB,      WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNGPQB]},
    {APOSA,     WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNAPOSA]},
    {APOSB,     WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNAPOSB]},
    {PHSA,      WIDTH_ONE_B,    *(WORD *)&SysParam[SP_RNPHSA]},
    {PHSB,      WIDTH_ONE_B,    *(WORD *)&SysParam[SP_RNPHSB]},
    {RPOSA,     WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNRPOSA]},
    {RPOSB,     WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNRPOSB]},
    {QPHSCAL,   WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNQPHSCAL]},
    {HFCONST,   WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNHFCONST]},
    {PSTART,    WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNPSTART]},
    {QSTART,    WIDTH_TWO_B,    *(WORD *)&SysParam[SP_RNQSTART]},
    {IE,        WIDTH_ONE_B,    *(WORD *)&SysParam[SP_RNIE]},
    {0 ,0 ,0}
};

#else

rn8209_fmt_t initTable[18] =
{
    {SYSCON,    WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNSYSCON]},  //0x40  开启B通道电流  0
    {IARMSOS,   WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNIARMSOS]}, //0xFB96               1
    {IBRMSOS,   WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNIBRMSOS]}, 
    {IBGAIN,    WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNIBGAIN]},
    {GPQA,      WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNGPQA]}, 
    {GPQB,      WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNGPQB]},
    {APOSA,     WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNAPOSA]},
    {APOSB,     WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNAPOSB]},
    {PHSA,      WIDTH_ONE_B,    (WORD *)&SysParam[SP_RNPHSA]},
    {PHSB,      WIDTH_ONE_B,    (WORD *)&SysParam[SP_RNPHSB]},
    {RPOSA,     WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNRPOSA]},
    {RPOSB,     WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNRPOSB]},
    {QPHSCAL,   WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNQPHSCAL]},
    {HFCONST,   WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNHFCONST]},   // 13
    {PSTART,    WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNPSTART]},    // 14
    {QSTART,    WIDTH_TWO_B,    (WORD *)&SysParam[SP_RNQSTART]},
    {IE,        WIDTH_ONE_B,    (WORD *)&SysParam[SP_RNIE]},
    {0 ,0 ,0}
};
#endif

void init8209(void)
{
    unsigned char i = 0;
    unsigned char j = 0;
 
    printf ( "\r\nRN8209 init..." );
    
    while(initTable[i].Bwidth)
    {
    	//有时写第一通道有问题
		spiWrite(0, initTable[0].add,*(initTable[0].value), initTable[0].Bwidth);
        for(j=0;j<9;j++)
        {
            spiWrite(j, initTable[i].add,*(initTable[i].value+j), initTable[i].Bwidth);
            //data = *(WORD *)&SysParam[SP_RNHFCONST+j*2];
            //spiWrite(j, initTable[i].add,data, initTable[i].Bwidth);
        }
        
        i++;
    }
    for(j=0;j<9;j++)
    {
        while(SSIBusy(SSI0_BASE))
        {
            ;
        }
    
        channelSelect(j);
        SSIDataPut(SSI0_BASE, 0xEA);
        SSIDataPut(SSI0_BASE, 0xE5);
    
        SSIDataPut(SSI0_BASE, 0xEA);
        SSIDataPut(SSI0_BASE, 0x5A);//选择A通道电流用着电能计算
        //SSIDataPut(SSI0_BASE, 0xA5);//选择B通道的电流用着电能计算
    
        SSIDataPut(SSI0_BASE, 0xEA);
        SSIDataPut(SSI0_BASE, 0xDC);
    }
    
}

void QF_PF_IRQn_Output(int channel)
{
    if(channel > 15 || channel < 0)
    {
        printf("\n150 channel over range.");
        return ;
    }
    GPIOPinWrite(GPIO_PORTD_BASE , GPIO_PIN_0, (channel & 0x08)? GPIO_PIN_0:0);
    GPIOPinWrite(GPIO_PORTC_BASE , GPIO_PIN_7, (channel & 0x04)? GPIO_PIN_7:0);
    GPIOPinWrite(GPIO_PORTD_BASE , GPIO_PIN_1, (channel & 0x02)? GPIO_PIN_1:0);            
    GPIOPinWrite(GPIO_PORTC_BASE , GPIO_PIN_6, (channel & 0x01)? GPIO_PIN_6:0);   
}


void getRawMeasure(int channel)
{
    unsigned long long  data=0;
    //ulong data=0;
    uint  Flag;
    //float temp = 0.0;
    uint temp =0;
    BYTE NflagPA =0;//有功通道A
//    BYTE NflagPB =0;//有功通道B
//    BYTE NflagPQ =0;//无功通道


    if(channel > 8 || channel < 0)
    {
        printf("\nSPI channel over range.\n");
        return ;
    }
    spiRead(channel, SYSCON, (uint *)&data, WIDTH_TWO_B);
    printf("\n SYSCON = 0x%x", (uint)data);
    
    spiRead(channel, EMUCON, (uint *)&data, WIDTH_TWO_B);
    printf("\n EMUCON = 0x%x", (uint)data);

    spiRead(channel, HFCONST, (uint *)&data, WIDTH_TWO_B);
    printf("\n HFCONST = 0x%x", (uint)data);
    
    spiRead(channel, PSTART, (uint *)&data, WIDTH_TWO_B);
    printf("\n PSTART = 0x%x", (uint)data);
    
    spiRead(channel, PFCNT, (uint *)&data, WIDTH_TWO_B);
    printf("\n PFCNT = 0x%x", (uint)data);
    
    spiRead(channel, QFCNT, (uint *)&data, WIDTH_TWO_B);
    printf("\n QFCNT = 0x%x\n", (uint)data);
 
    spiRead(channel, IARMSOS, (uint *)&data, WIDTH_TWO_B);
    printf("\n IARMSOS = 0x%x", (uint)data);   
    spiRead(channel, IBRMSOS, (uint *)&data, WIDTH_TWO_B);
    printf("\n IBRMSOS = 0x%x", (uint)data);
    
    spiRead(channel, GPQA, (uint *)&data, WIDTH_TWO_B);
    printf("\n GPQA  = 0x%x", (uint)data);   
    spiRead(channel, GPQB, (uint *)&data, WIDTH_TWO_B);
    printf("\n GPQB  = 0x%x", (uint)data);

    spiRead(channel, APOSA, (uint *)&data, WIDTH_TWO_B);
    printf("\n APOSA = 0x%x", (uint)data); 
    spiRead(channel, APOSB, (uint *)&data, WIDTH_TWO_B);
    printf("\n APOSB = 0x%x", (uint)data);
    
    spiRead(channel, RPOSA, (uint *)&data, WIDTH_TWO_B);
    printf("\n RPOSA = 0x%x", (uint)data);
    spiRead(channel, RPOSB, (uint *)&data, WIDTH_TWO_B);
    printf("\n RPOSB = 0x%x", (uint)data);

    spiRead(channel, PHSA, (uint *)&data, WIDTH_ONE_B);
    printf("\n PHSA = 0x%x", (uint)data);
    spiRead(channel, PHSB, (uint *)&data, WIDTH_ONE_B);
    printf("\n PHSB = 0x%x", (uint)data);

    spiRead(channel, QPHSCAL, (uint *)&data, WIDTH_TWO_B);
    printf("\n QPHSCAL = 0x%x\n", (uint)data);
      
