yanlunyao/stm32_lwip_ucos_udp_test/UCOS-Sem/src/dev/rn8209x.c
    spiRead(channel, IARMS, (uint *)&data, WIDTH_THREE_B);
   
    if((data >= 0x800000)||(data == 0))
    {
        data = 0;
        temp = 0;
    }
    else
    {
        temp = (uint)(((*(WORD *)&SysParam[SP_RNKIA+2*channel])*data)/10000+1);//补偿0.1mA
    }
    printf("\n IARMS = 0x%x current:%d.%d mA  KiA=%d", (uint)data, temp/10,temp%10,*(WORD *)&SysParam[SP_RNKIA+2*channel]);
    printf("\n IARMSV =%dmV ",(uint)(data*2500/(0x7FFFFF+1)));
/*    
    spiRead(channel, IBRMS, &data, WIDTH_THREE_B);
    if((data >= 0x800000)||(data == 0))
    {
        data = 0;
        temp = 0;
    }
    else
    {
        temp = ((*(WORD *)&SysParam[SP_RNKIB+2*channel]) * data)/10000+1;// 补偿0.1mA
    }
    printf("\n IBRMS = 0x%x current:%d.%d mA  KiB=%d", data, temp/10,temp%10,*(WORD *)&SysParam[SP_RNKIB+2*channel]);
*/    
    spiRead(channel, URMS, (uint *)&data, WIDTH_THREE_B);
    printf("\n URMS = 0x%x ", (uint)data);
    
    if((data >= 0x800000)||(data < 0x24B))
    {    
        data = 0;
    }
 
    temp = (uint)(((*(WORD *)&SysParam[SP_RNKU+2*channel])* data)/1000000);
    printf("\n URMS  = 0x%x voltage:%d.%d V Ku=%d", (uint)data, temp/10,temp%10,(*(WORD *)&SysParam[SP_RNKU+2*channel]));
    printf("\n URMSV =%dmV ",(uint)(data*2500/(0x7FFFFF+1)));
    spiRead(channel, UFREQ, (uint *)&data, WIDTH_TWO_B);
    printf("\n UFREQ = 0x%x\n", (uint)data);
    
    spiRead(channel, POWERPA, (uint *)&data, WIDTH_FOUR_B);
    printf("\n POWERPA = 0x%x", (uint)data);
    if(data>0x80000000)//负数
    {   
        spiRead(channel, EMUSTATUS, &Flag, WIDTH_THREE_B);
        if((Flag&0x20000)&&((Flag&0x200000)==0))//REVP=1,chnsel=0
        {
            data = (data-1)^0x7fffffff;
            data =data&0x7fffffff;
            //data = ~data+1;
            NflagPA=1;
        }
        else
        {
            data =0;    
        }
        
    }
    //数据有溢出可能
   
   temp = (uint )(((*(WORD *)&SysParam[SP_RNKAP+2*channel])*data)/1000000);//扩大10
   
    if(NflagPA == 1)
    {
        NflagPA=0;
        printf("\n POWERPA = 0x%x PA=-%d.%d W  KpA=%d", (uint)data,temp/10,temp%10,*(WORD *)&SysParam[SP_RNKAP+2*channel]);   
    }
    else
    {
        printf("\n POWERPA = 0x%x PA= %d.%d W  KpA=%d", (uint)data,temp/10,temp%10,*(WORD *)&SysParam[SP_RNKAP+2*channel]);
    }
    /*
    spiRead(channel, POWERPB, &data, WIDTH_FOUR_B);
    printf("\n POWERPB = 0x%x", data );
    if(data>0x80000000)//负数
    {
        spiRead(channel, EMUSTATUS, &Flag, WIDTH_THREE_B);
        if((Flag&0x20000)&&((Flag&0x200000)==1))//REVP=1,chnsel=1
        {
            data = (data-1)^0x7fffffff;
            data = data&0x7fffffff;
            NflagPB =1;
        }
        else
        {
            data =0;    
        }
    }
    
    temp = ((*(WORD*)&SysParam[SP_RNKBP+2*channel])*data)/1000000;
    if(NflagPB == 1)
    {
        NflagPB =0;
        printf("\n POWERPB = 0x%x PB=-%d.%d W  KpB=%d", data,temp/10,temp%10,*(WORD*)&SysParam[SP_RNKBP+2*channel]);
    }
    else
    {
        printf("\n POWERPB = 0x%x PB= %d.%d W  KpB=%d", data,temp/10,temp%10,*(WORD*)&SysParam[SP_RNKBP+2*channel]);
    }    
    spiRead(channel, POWERQ, &data, WIDTH_FOUR_B);
    printf("\n POWERQ  = 0x%x", data);
    if(data>0x80000000)//负数
    {
        spiRead(channel, EMUSTATUS, &Flag, WIDTH_THREE_B);
        if(Flag&0x30000)//REVQ=1
        {
            data = ((data-1)^0x7fffffff);
            data = data&0x7fffffff;
            NflagPQ =1;
        }
        else
        {
            data =0;    
        }
    }
    if(NflagPQ ==1)
    {
        NflagPQ = 0; 
    }
    else
    {
    
    }
    printf("\n POWERQ  = 0x%x\n", data);
    */
    spiRead(channel, ENERGYP, (uint *)&data, WIDTH_THREE_B);
    temp = (data+ *(DWORD *)&EEPROMPARAM[EEPROM_ENERGY + 4*channel])*100/EC;
    printf("\n ENERGYP = 0x%x , EE= %d.%d%d kWh", (uint)data,temp/100,temp%100/10,temp%10);

    spiRead(channel, ENERGYP2, (uint *)&data, WIDTH_THREE_B);
    temp = data*100/EC;
    printf("\n ENERGYP2 = 0x%x ,EE2= %d.%d%d kWh", (uint)data,temp/100,temp%100/10,temp%10);
        
    spiRead(channel, ENERGYQ, (uint *)&data, WIDTH_THREE_B);
    printf("\n ENERGYQ = 0x%x", (uint)data);
    temp = data*100/EC;
    printf("\n ENERGYPQ = %d kVARh\n", (uint)data);

    
    spiRead(channel, IF, (uint *)&data, WIDTH_ONE_B);
    printf("\n interrupt = 0x%x", (uint)data);

    spiRead(channel, IE, (uint *)&data, WIDTH_ONE_B);
    printf("\n IE = 0x%x", (uint)data);
    
    spiRead(channel, EMUSTATUS, (uint *)&data, WIDTH_THREE_B);
    printf("\n EMUSTATUS = 0x%x", (uint)data);

    spiRead(channel, HFCONST, (uint *)&data, WIDTH_TWO_B);
    printf("\n HFCONST = 0x%x  buf=0x%x", (uint)data,*(WORD *)&SysParam[SP_RNHFCONST+2*channel]);

    QF_PF_IRQn_Output(channel);

}

//8209中断处理函数
//1.采用周期任务去读中断标志寄存器
//2.用中断引脚
#if 0
void taskRnIsr(void *pmsg)
{
    BYTE err;
    uint IFData=0;
    uint PData=0;
    uint channel;
//    static BYTE flag[9]={0};

    printf ( "\r\nIsr task begin..." );
       
    while(1)
    {
        OSSemPend(RNSemIsr,0,&err);
        //printf("insert isr\n");
        for(channel=0;channel<9;channel++)
        {
            spiRead(channel, RIF, &IFData, WIDTH_ONE_B);
            if(IFData & RN_RPEOIF)//溢出中断
            {
                printf("overflow\n");
                SysParam[SP_PEOIF_COUNT+channel]++;//记录每个通道电能寄存器溢出次数   
                SaveSysParam(); 
                //Read_FM24C(FM_address, OVERFLOW_COUNT+channel,&temp[0], 1);
                //temp[0]++;
                //Write_FM24C(FM_address, OVERFLOW_COUNT+channel,&temp[0], 1);
                
                spiRead(channel, ENERGYP2, &PData, WIDTH_THREE_B);//CLEAR ENERGYP2
                PData = 0x00;
                Write_FM24C(FM_address, A_EEAddr+channel*3,(BYTE *)&PData, 3);
            }

            if(IFData & RN_RPFIF)//PF脉冲
            {
                printf("PF%d\n",channel);
                pfcount[channel]++;
                if( pfcount[channel]==32)
                {   
                    pfcount[channel]=0;
                    spiRead(channel, ENERGYP2, &PData, WIDTH_THREE_B);
                    
                    Read_FM24C(FM_address, A_EEAddr+channel*3, (BYTE*)&IFData, 3);
                    PData +=IFData;
                    printf("energyp%d=%d\n",channel,PData);
                    //将读出的电能值存入铁电
                    Write_FM24C(FM_address, A_EEAddr+channel*3, (BYTE*)&PData, 3);
                }
            }

