yanlunyao/stm32_lwip_ucos_udp_test/UCOS-Sem/src/dev/rn8209x.c
        } 
        //channelSelect(0);   
    }

}

#endif
void ShowMeterAddr(void)
{
    printf("\r\n**************************************\r\n");
    printf("*************Set Meter No*************\r\n");
    printf("**************************************\r\n");
    printf("\nnumber=05-04-03-02-01-00");
    printf("\nMAddr1=%02x-%02x-%02x-%02x-%02x-%02x\n",SysParam[SP_METERADDR1+5],SysParam[SP_METERADDR1+4],\
    SysParam[SP_METERADDR1+3],SysParam[SP_METERADDR1+3],SysParam[SP_METERADDR1+1],SysParam[SP_METERADDR1]);
    printf("\nnumber=11-10-09-08-07-06");
    printf("\nMAddr2=%02x-%02x-%02x-%02x-%02x-%02x\n",SysParam[SP_METERADDR2+5],SysParam[SP_METERADDR2+4],\
    SysParam[SP_METERADDR2+3],SysParam[SP_METERADDR2+2],SysParam[SP_METERADDR2+1],SysParam[SP_METERADDR2]);
    printf("\nnumber=17-16-15-14-13-12");
    printf("\nMAddr3=%02x-%02x-%02x-%02x-%02x-%02x\n",SysParam[SP_METERADDR3+5],SysParam[SP_METERADDR3+4],\
    SysParam[SP_METERADDR3+3],SysParam[SP_METERADDR3+2],SysParam[SP_METERADDR3+1],SysParam[SP_METERADDR3]);
#if(EleMeterCnt==6)
    printf("\nnumber=18-19-20-21-22-23");
    printf("\nMAddr4=%02x-%02x-%02x-%02x-%02x-%02x\n",SysParam[SP_METERADDR4+5],SysParam[SP_METERADDR4+4],\
    SysParam[SP_METERADDR4+3],SysParam[SP_METERADDR4+2],SysParam[SP_METERADDR4+1],SysParam[SP_METERADDR4]);
    printf("\nnumber=24-25-26-27-28-29");
    printf("\nMAddr5=%02x-%02x-%02x-%02x-%02x-%02x\n",SysParam[SP_METERADDR5],SysParam[SP_METERADDR5+1],\
    SysParam[SP_METERADDR5+2],SysParam[SP_METERADDR5+3],SysParam[SP_METERADDR5+4],SysParam[SP_METERADDR5+5]);
    printf("\nnumber=30-31-32-33-34-35");
    printf("\nMAddr6=%02x-%02x-%02x-%02x-%02x-%02x\n",SysParam[SP_METERADDR6],SysParam[SP_METERADDR6+1],\
    SysParam[SP_METERADDR6+2],SysParam[SP_METERADDR6+3],SysParam[SP_METERADDR6+4],SysParam[SP_METERADDR6+5]);
#endif
    printf("\r\n");
    printf("Q:Quit \r\n");
    printf("\r\n");

}
void RnCheckSelf()
{
    BYTE i =0;
  
    for(i=0;i<9;i++)
    {   
        RnCheckSelfCh(i);
        
    }    
    
}
void RnCheckSelfCh(BYTE channel)
{
    BYTE j =0;
    uint temp[10]={0};
    uint tempp=0;

    //printf("\r\n channel_%d ",channel);
    //APOSA
    for(j=0;j<10;j++)
    {
        while(1)
        {
            OSTimeDlyHMSM(0, 0, 0, 100);
            spiRead(channel, RIF, &tempp, WIDTH_ONE_B);
            if(tempp&0x01)//更新中断
            {
                break;
            }
        }
        spiRead(channel, POWERPA, &tempp, WIDTH_FOUR_B);
        temp[j] = tempp;    
    }
      
    tempp =MeanValue(temp,10);
    tempp =(tempp^0xffffffff)+1;
    tempp =tempp&0xffff;
    spiWrite(channel, APOSA, tempp, WIDTH_TWO_B);
    *(WORD *)&SysParam[SP_RNAPOSA+channel*2]=tempp;
    printf("#"); 
#if(EleMeterCnt==6)
    //APOSB
    for(j=0;j<10;j++)
    {
        while(1)
        {
            OSTimeDlyHMSM(0, 0, 0, 100);
            spiRead(channel, RIF, &tempp, WIDTH_ONE_B);
            if(tempp&0x01)
            {
                break;
            }
        }
        spiRead(channel, POWERPB, &tempp, WIDTH_FOUR_B);
        temp[j]=tempp;    
    }
        
    tempp =MeanValue(temp,10);
    tempp =(tempp^0xffffffff)+1;
    tempp =tempp&0xffff;
    spiWrite(channel, APOSB, tempp, WIDTH_TWO_B);
    *(WORD *)&SysParam[SP_RNAPOSB+channel*2]=tempp;
    printf("#"); 
#endif
   //rposa/rposb
    for(j=0;j<10;j++)
    {
        while(1)
        {
            OSTimeDlyHMSM(0, 0, 0, 100);
            spiRead(channel, RIF, &tempp, WIDTH_ONE_B);
            if(tempp&0x01)
            {
                break;
            }
        }
        spiRead(channel, POWERQ, &tempp, WIDTH_FOUR_B);
        temp[j]=tempp;    
    }
       
    tempp =MeanValue(temp,10);
    tempp =(tempp^0xffffffff)+1;
    tempp =tempp&0xffff;
    spiRead(channel, EMUSTATUS, &temp[0], WIDTH_THREE_B);
    if(temp[0]&0x200000)
    {
        spiWrite(channel, RPOSB, tempp, WIDTH_TWO_B);
        *(WORD *)&SysParam[SP_RNRPOSB+channel*2]=tempp;
    }
    else
    {
        spiWrite(channel, RPOSA, tempp, WIDTH_TWO_B);
        *(WORD *)&SysParam[SP_RNRPOSA+channel*2]=tempp;
    }
    printf("#"); 
    
    //iarmsos
    for(j=0;j<10;j++)
    {
        while(1)
        {
            OSTimeDlyHMSM(0, 0, 0, 100);
            spiRead(channel, RIF, &tempp, WIDTH_ONE_B);
            if(tempp&0x01)
            {
                break;
            }
        }
        spiRead(channel, IARMS, &tempp, WIDTH_THREE_B);
        temp[j] = tempp;    
    }
        
    tempp =MeanValue(temp,10);
    tempp =tempp*tempp;
    tempp =(tempp^0xffffffff)+1;
    tempp =tempp>>8;
    //tempp =tempp&0xffff;
    tempp =(tempp&0xffff)|((tempp>>8)&0x8000);
    spiWrite(channel, IARMSOS, tempp, WIDTH_TWO_B);
    *(WORD *)&SysParam[SP_RNIARMSOS+channel*2]=tempp;
    printf("#"); 
#if(EleMeterCnt==6)    
    //ibrmsos
    for(j=0;j<10;j++)
    {
        while(1)
        {
            OSTimeDlyHMSM(0, 0, 0, 100);
            spiRead(channel, RIF, &tempp, WIDTH_ONE_B);
            if(tempp&0x01)
            {
                break;
            }
        }
        spiRead(channel, IBRMS, &tempp, WIDTH_THREE_B);
        temp[j] =tempp;    
    }
        
    tempp =MeanValue(temp,10);
    tempp =tempp*tempp;
    tempp =(tempp^0xffffffff)+1;
    tempp =tempp>>8;
    //tempp =tempp&0xffff;
    tempp =(tempp&0xffff)|((tempp>>8)&0x8000);
    spiWrite(channel, IBRMSOS, tempp, WIDTH_TWO_B);
    *(WORD *)&SysParam[SP_RNIBRMSOS+channel*2]=tempp;
#endif
}


void taskPriod ( void *pParam )
{
 
   static unsigned long long data = 0;
   
   static uint Flag = 0;    
   static uint tempAi[9] ={0};
//   static uint tempBi[9] ={0};
   static uint tempU[9]  ={0};
   static uint tempEE[9] ={0};
   static uint tempPA[9] ={0};
//   static uint tempPB[9] ={0};

//   static ulong tempQE[9] ={0};
   static BYTE channel =0;
   static BYTE i=0;
   static BYTE count=0;
   printf ( "\r\nPriod task begin..." );

    while ( 1 )
    {
        
        OSTimeDly ( OS_TICKS_PER_SEC*2); 
        updatePeriodChk();
        ReadRealtime();
        count++;
        
        for(channel=0;channel<9;channel++)
        {
            spiRead(channel, IARMS, (uint *)&data, WIDTH_THREE_B);
            //printf("IARMS=%d\r\n",*(uint *)&data);
            if(data >= 0x800000)
            {
                data = 0;
                tempAi[channel]= 0;
            }
            else
            {
                tempAi[channel]= (uint)(((*(WORD *)&SysParam[SP_RNKIA+2*channel])*data)/10000+1);// 0.1mA   补偿0.1mA
            }
            #if(EleMeterCnt==6) 
            spiRead(channel, IBRMS, &data, WIDTH_THREE_B);
            if(data >= 0x800000)
            {
                data = 0;
                tempBi[channel] =0;
            }
            else
            {
                tempBi[channel] = ((*(WORD *)&SysParam[SP_RNKIB+2*channel]) * data)/10000+1;// 0.1mA 补偿0.1mA
            }
            #endif
            spiRead(channel, URMS, (uint *)&data, WIDTH_THREE_B);
            //printf("URMS=%d\r\n",*(uint *)&data);
            if((data >= 0x800000)||(data < 0x24B))
            {    
                data = 0;
            }
        
            tempU[channel] = (uint)(((*(WORD *)&SysParam[SP_RNKU+2*channel])* data)/1000000);// 0.1V
            
