yanlunyao/stm32_lwip_ucos_udp_test/UCOS-Sem/src/dev/rn8209x.c
            //A通道功率
            spiRead(channel, POWERPA, (uint *)&data, WIDTH_FOUR_B);
            //printf("POWERPA=%d\r\n",*(uint *)&data);
            if(data>0x80000000)//负数
            {   
                spiRead(channel, EMUSTATUS, &Flag, WIDTH_THREE_B);
                if(Flag&0x20000)//REVP=1
                {
                    data = (data-1)^0x8fffffff;
                    data = data&0x7fffffff;
                }
                else
                {
                    data =0;    
                }
        
             }
            
            tempPA[channel] = (uint)(((*(WORD *)&SysParam[SP_RNKAP+2*channel])*data)/1000000);// 0.1W
        
            
            #if(EleMeterCnt==6)            
            spiRead(channel, POWERPB, (uint *)&data, WIDTH_FOUR_B);
            
            if(data>0x80000000)//负数
            {
                spiRead(channel, EMUSTATUS, &Flag, WIDTH_THREE_B);
                if(Flag&0x20000)//REVP=1
                {
                    data = (data-1)^0x8fffffff;
                }
                else
                {
                    data =0;    
                }
            }
        
            tempPB[channel] = ((*(WORD*)&SysParam[SP_RNKBP+2*channel])*data)/1000000;
            #endif
            #if 0
            //无功功率
            spiRead(channel, POWERQ, &data, WIDTH_FOUR_B);
            if(data>0x80000000)//负数
            {
                spiRead(channel, EMUSTATUS, &Flag, WIDTH_THREE_B);
                if(Flag&0x40000)//REVQ=1
                {
                    data = (data-1)^0x8fffffff;
                }
                else
                {
                    data =0;    
                }
            }
            #endif
            //读中断标志位
            spiRead(channel, RIF, (uint *)&data, WIDTH_ONE_B);
            if(data & RN_RPEOIF)//溢出中断
            {
                printf("overflow=%d\n",channel);
                
                *(DWORD *)&EEPROMPARAM[EEPROM_ENERGY+4*channel]= 0;
                EEPROMPARAM[EEPROM_OVERFLOW+channel] +=1;
                Write_FM24C(FMSLAVE_ADDR, EEPROM_OVERFLOWADDR+channel,&EEPROMPARAM[EEPROM_OVERFLOW+channel], 1);
            }
            
            spiRead(channel, ENERGYP, (uint *)&data, WIDTH_THREE_B);//
            
            *(DWORD *)&EEPROMPARAM[EEPROM_ENERGYLAST+4*channel] = data;
            
            data += *(DWORD *)&EEPROMPARAM[EEPROM_ENERGY+4*channel] ;
            
            if(count == 5)//10s
            {
                if(channel == 8)
                {
                    count = 0;
                } 
                Write_FM24C(FMSLAVE_ADDR, EEPROM_ENERGY+4*channel,(BYTE *)&data, 4);
                Write_FM24C(FMSLAVE_ADDR, EEPROM_ENERGYLAST+4*channel,(BYTE *)&EEPROMPARAM[EEPROM_ENERGYLAST+4*channel], 4);
            }
            tempEE[channel]=(data+EEPROMPARAM[EEPROM_OVERFLOW + channel]*0xffffff)/(EC/100);    
          
        }
        #if(EleMeterCnt==3)

        for(i=0;i<3;i++)
        {
            EMeterDat[i].Ai = tempAi[i]/10;//mA
            EMeterDat[i].Bi = tempAi[i+3]/10;
            EMeterDat[i].Ci = tempAi[i+6]/10;

            EMeterDat[i].Au = (tempU[0]+tempU[1]+tempU[2])/3;//100mV  0.1V
            EMeterDat[i].Bu = (tempU[3]+tempU[4]+tempU[5])/3;
            EMeterDat[i].Cu = (tempU[6]+tempU[7]+tempU[8])/3;
                                                                                            
            EMeterDat[i].AE = tempEE[i];// 0.01kWh,电表常数3200
            EMeterDat[i].BE = tempEE[i+3];
            EMeterDat[i].CE = tempEE[i+6];
            
            EMeterDat[i].PWRA = tempPA[i];//功率
            EMeterDat[i].PWRB = tempPA[i+3];
            EMeterDat[i].PWRC = tempPA[i+6];
            
            EMeterDat[i].PWR = tempPA[0+i]+tempPA[i+3]+tempPA[i+6];
            
            EMeterDat[i].EE = EMeterDat[i].AE+EMeterDat[i].BE+EMeterDat[i].CE;// 0.01kwh
                
        }
        #else          
        for(i=0;i<6;i++)
        {
            if((i%2)==0)
            {
                EMeterDat[i].Ai=tempAi[i/2]/10;//mA
                EMeterDat[i].Bi=tempAi[i/2+3]/10;
                EMeterDat[i].Ci=tempAi[i/2+6]/10;
            }
            else
            {
                EMeterDat[i].Ai=tempBi[i/2]/10;//mA
                EMeterDat[i].Bi=tempBi[i/2+3]/10;
                EMeterDat[i].Ci=tempBi[i/2+6]/10;
            }

            EMeterDat[i].Au=(tempU[0]+tempU[1]+tempU[2])/3;//100mV  0.1V
            EMeterDat[i].Bu=(tempU[3]+tempU[4]+tempU[5])/3;
            EMeterDat[i].Cu=(tempU[6]+tempU[7]+tempU[8])/3;

            if((i%2)==0)
            {
                EMeterDat[i].AE=tempEE[i/2];//0.01kwh 
                EMeterDat[i].BE=tempEE[i/2+3];
                EMeterDat[i].CE=tempEE[i/2+6];
            }
            else
            {
                EMeterDat[i].AE=EEB[i/2];//0.01kwh 
                EMeterDat[i].BE=EEB[i/2+3];
                EMeterDat[i].CE=EEB[i/2+6];
            }

            EMeterDat[i].EE=EMeterDat[i].AE+EMeterDat[i].BE+EMeterDat[i].CE;// 0.01kwh   
                
        }  
        #endif
    }
}
/*******************************************************/
/*函数功能: 在输入电流为dati( dati 精确到0.1mA)的情况下*/
/*来校正通道A、B的K值                                  */
/*******************************************************/
void Check_KIA_KIB(BYTE channel,uint dati)
{
    BYTE j =0;
    BYTE i =0;
    uint temp=0;
    uint temp1[10]={0};
    uint len=10;
    unsigned long long dbuf = 0;
    
    for(j=0;j<len;j++)
    {
        while(1)
        {
            OSTimeDlyHMSM(0, 0, 0, 150);
            spiRead(channel, RIF, &temp, WIDTH_ONE_B);
            if(temp&0x01)
            {
                break;
            }
        }
        spiRead(channel, IARMS, &temp, WIDTH_THREE_B);
        if(temp < 0x800000)//大于 0x800000 时做零处理
        {
            temp1[i] = temp;
            i++;
        }
        temp = 0;
    }
    
    temp = MeanValue(temp1,i);
    dbuf = dati;
    
    *(WORD *)&SysParam[SP_RNKIA+2*channel] = dbuf*10000/temp; // 最小单位为1mA来计算的K
    i =0;
    printf("#");   
#if(EleMeterCnt==6) 
    for(j=0;j<len;j++)
    {
        while(1)
        {
            OSTimeDlyHMSM(0, 0, 0, 150);
            spiRead(channel, RIF, &temp, WIDTH_ONE_B);
            if(temp&0x01)
            {
                break;
            }
        }
        spiRead(channel, IBRMS, &temp, WIDTH_THREE_B);
        if(temp < 0x800000)//大于 0x800000 时做零处理
        {
            temp1[i] = temp;
            i++;
        }
        temp = 0;
    }
    
    tempp = MeanValue(temp1,i);
    *(WORD *)&SysParam[SP_RNKIB+2*channel] = dati*10000/tempp;
    printf("#");
#endif
 
