yanlunyao/stm32_lwip_ucos_udp_test/UCOS-Sem/src/dev/rn8209x.c
}

/*******************************************************/
/*函数功能: 在输入电压为datu(精确到0.1V)的情况下       */
/*来校正Ku值                                           */
/*******************************************************/

void Check_KU(BYTE channel,uint datu)
{
    BYTE j =0;
    BYTE i =0;

    uint temp =0;
    uint temp1[10]={0};
    uint tempp=0;
    uint len=10;
    for(j=0;j<len;j++) //读取10次
    {
        while(1)
        {
            OSTimeDlyHMSM(0, 0, 0, 150);
            spiRead(channel, RIF, &temp, WIDTH_ONE_B);
            if(temp&0x01)
            {
                break;
            }
        }
        spiRead(channel, URMS, &temp, WIDTH_THREE_B);
        if(temp < 0x800000)//大于 0x800000 时做零处理
        {
            temp1[i] = temp;
            i++;
        }
        temp = 0;

    }
    
    tempp = MeanValue(temp1,i);
    *(WORD *)&SysParam[SP_RNKU+2*channel] = datu*1000000/tempp; // 
    printf("#");
}
/*******************************************************/
/*函数功能: 在功率为datp(精确到0.1W)时                 */
/*校正通道A、B的Kp值                                   */
/*******************************************************/

void Check_KPA_KPB(BYTE channel,uint datp)
{
    BYTE j =0;
    BYTE i =0;

    uint temp =0;
    uint temp1[10]={0};    
    uint len=10;
	unsigned long long dbuf=0;
	
    for(j=0;j<len;j++)
    {
        while(1)
        {
            OSTimeDlyHMSM(0, 0, 0, 150);
            spiRead(channel, RIF, &temp, WIDTH_ONE_B);
            if(temp&0x01)
            {
                break;
            }
        }
        spiRead(channel, POWERPA, &temp, WIDTH_FOUR_B);
        if(temp < 0x80000000)//大于 0x80000000 时为负
        {
            temp1[i] = temp;
            i++;
        }
        temp = 0;
    }
    
    temp = MeanValue(temp1,i);
    dbuf = datp;//避免数据溢出
    
    *(WORD *)&SysParam[SP_RNKAP+2*channel] = dbuf*1000000/temp;//最小单位为0.1W 来计算的K
    i =0;
    printf("#");

    /*
    for(j=0;j<len;j++)
    {
        while(1)
        {
            OSTimeDlyHMSM(0, 0, 0, 100);
            spiRead(channel, RIF, &temp, WIDTH_ONE_B);
            if(temp&0x01)
            {
                break;
            }
        }
        spiRead(channel, POWERPB, &temp, WIDTH_FOUR_B);
        if(tempp < 0x80000000)//大于 0x80000000 时为负
        {
            temp1[i] = temp;
            i++;
        }
        temp = 0;
    }
    
    tempp = MeanValue(temp1,i);
    *(WORD *)&SysParam[SP_RNKBP+2*channel] = datp*1000000/tempp; //最小单位0.1W 来计算的K
    printf("*");*/
}
/**************************************************************/
/*函数功能: 能量脉冲校正 ，电表常数3200                       */
/*校验方法: 将电流、电压、功率校正好后，外挂标志的100W        */
/*的功率源，连接8小时时间，即可完成校验(在PE0中断函数中断用)  */
/*需先用命令Checkhf enable将变量CheckHFConstFlag设置为1       */
/**************************************************************/
//方式一:用标准功率源(100W)
//pBuf每小时脉冲个数
#if 0
void Check_HFConst(uint *pBuf,BYTE len ,BYTE channel)
{
    uint temp;
     
    temp = MeanValue(pBuf, len);
    *(WORD *)&SysParam[SP_RNHFCONST+2*channel] = *(WORD *)&SysParam[SP_RNHFCONST+2*channel]*temp/32;
    spiWrite(channel, HFCONST, *(WORD *)&SysParam[SP_RNHFCONST+2*channel], WIDTH_TWO_B);
    SaveSysParam();
    
}
#endif
//方式二:跟标准表对照
//原理:因为PFCNT的绝对值的2倍大于HFConst的值时ENERGYP的值加1，所以HFConst'*ENERGYP就应该等于消耗的实际能量值，
//而实际消耗的能量值可以用另外的表读出(datE)，datE*期望的电表常数EC,就是我们期望的能量脉冲值
//HFConst'(表中的值)*ENERGYP(读出829)=HFConst(期望的)*(datE*EC)
//EBuf被校表电能寄存器的值，datE对照表的电能值，以0.01KWh为单位，比如0.05KWh，则datE为5
void Check_HFConst1(BYTE channel,uint datE)
{
    unsigned long long EBuf=0;
    uint temp=0;
    spiRead(channel, ENERGYP, &temp, WIDTH_THREE_B);
    EBuf = temp;

    //扩大10
    temp = (uint)((*(WORD *)&SysParam[SP_RNHFCONST+2*channel])*EBuf*10/(EC/100*datE));//EC=200
    printf("temp%d=0x%x ",channel,temp);
    //4舍5入
    if(temp%10 >= 5)
    {
        *(WORD *)&SysParam[SP_RNHFCONST+2*channel] = (WORD)(temp/10+1);        
    }
    else
    {
        *(WORD *)&SysParam[SP_RNHFCONST+2*channel] = (WORD)(temp/10);
    }
    OSTimeDly(OS_TICKS_PER_SEC/50);
    printf("\nSP_HCONST%d=0x%x ",channel,*(WORD *)&SysParam[SP_RNHFCONST+2*channel]);
    spiWrite(channel, HFCONST, *(WORD *)&SysParam[SP_RNHFCONST+2*channel], WIDTH_TWO_B);
    
    //SaveSysParam();
}
#if 0
//方式二:跟标准表对照
//EBuf被校表电能寄存器的值，datE对照表的电能值，以0.01KWh为单位，比如0.05KWh，则datE为5
void Check_HFConst2(uint EBuf, uint datE,BYTE channel)
{
    *(WORD *)&SysParam[SP_RNHFCONST+2*channel] = EBuf * (*(WORD *)&SysParam[SP_RNHFCONST+2*channel])/(320*datE);
    spiWrite(channel, HFCONST, *(WORD *)&SysParam[SP_RNHFCONST+2*channel], WIDTH_TWO_B);
    SaveSysParam();
}
#endif

